<template>
    <el-row :gutter="20">
        <el-col :span="6"><div class="grid-content bg-purple">
            <ve-line :data="lineData"></ve-line>
        </div></el-col>
        <el-col :span="6"><div class="grid-content bg-purple">
            <ve-pie :data="pieData"></ve-pie>
        </div></el-col>
        <el-col :span="6"><div class="grid-content bg-purple">
            <ve-scatter :data="scatterData"></ve-scatter>
        </div></el-col>
        <el-col :span="6"><div class="grid-content bg-purple"></div></el-col>
    </el-row>

</template>

<script>
    import VeLine from 'v-charts/lib/line.common';
    import VePie from 'v-charts/lib/pie.common';
    import VeScatter from 'v-charts/lib/scatter.common';
    export default {
        name: "Echarts",
        components:{
            VeLine,VePie,VeScatter
        },
        data(){
            return {
                lineData: {
                    columns: ['日期', '访问用户', '下单用户'],
                    rows: [
                        {'日期': '2020-04-12', '访问用户': '2343', '下单用户': '1945'},
                        {'日期': '2020-09-25', '访问用户': '733', '下单用户': '2005'},
                        {'日期': '2020-06-06', '访问用户': '4122', '下单用户': '6345'},
                    ]
                },
                pieData: {
                    columns: ['日期', '访问用户'],
                    rows: [
                        {'日期': '1/1', '访问用户': 1393},
                        {'日期': '1/2', '访问用户': 3530},
                        {'日期': '1/3', '访问用户': 2923},
                        {'日期': '1/4', '访问用户': 1723},
                        {'日期': '1/5', '访问用户': 3792},
                        {'日期': '1/6', '访问用户': 4593}
                    ]
                },
                scatterData: {
                    columns: ['日期', '访问用户', '下单用户', '年龄'],
                    rows: {
                        '上海': [
                            {'日期': '1/1', '访问用户': 123, '年龄': 3, '下单用户': 1244},
                            {'日期': '1/2', '访问用户': 1223, '年龄': 6, '下单用户': 2344},
                            {'日期': '1/3', '访问用户': 7123, '年龄': 9, '下单用户': 3245},
                            {'日期': '1/4', '访问用户': 4123, '年龄': 12, '下单用户': 4355},
                            {'日期': '1/5', '访问用户': 3123, '年龄': 15, '下单用户': 4564},
                            {'日期': '1/6', '访问用户': 2323, '年龄': 20, '下单用户': 6537}
                        ],
                        '北京': [
                            {'日期': '1/1', '访问用户': 123, '年龄': 3, '下单用户': 1244},
                            {'日期': '1/2', '访问用户': 1273, '年龄': 6, '下单用户': 2344},
                            {'日期': '1/3', '访问用户': 3123, '年龄': 15, '下单用户': 4564},
                            {'日期': '1/4', '访问用户': 2123, '年龄': 9, '下单用户': 3245},
                            {'日期': '1/5', '访问用户': 4103, '年龄': 12, '下单用户': 4355},
                            {'日期': '1/6', '访问用户': 7123, '年龄': 10, '下单用户': 3567}
                        ],
                        '广州': [
                            {'日期': '1/1', '访问用户': 123, '年龄': 3, '下单用户': 1244},
                            {'日期': '1/2', '访问用户': 1223, '年龄': 6, '下单用户': 2344},
                            {'日期': '1/3', '访问用户': 2123, '年龄': 30, '下单用户': 3245},
                            {'日期': '1/5', '访问用户': 4123, '年龄': 12, '下单用户': 4355},
                            {'日期': '1/4', '访问用户': 5123, '年龄': 18, '下单用户': 4564},
                            {'日期': '1/6', '访问用户': 3843, '年龄': 30, '下单用户': 4850}
                        ]
                    }
                }
            }
        }
    }
</script>

<style scoped>

</style>